{
  "id": 1,
  "contentDE": "Der FPV Video Channelsorter 5.8GHz ist ein Open Source Hilfstool für FPV (First Person View) Modellflugzeug Piloten. Die App berechnet die optimale Verteilung von verfügbaren Frequenzen auf Piloten, um gegenseitige Störung und Überlagerung von den analogen Videosignalen zu vermindern.  \nDa Piloten oft in Gebieten fliegen wo schlechtes oder kein Mobilfunknetz vorhanden ist, werden alle Berechnungen lokal auf dem Smartphone ausgeführt. In den Jahren der Entwicklung sind immer wieder kleine Features hinzugekommen, wie eine Übersicht aller Frequenzbänder der verschiedenen Hersteller und das Speichern und laden von Piloten presets.\n\n![App IMG](/assets/img/projects/0001/1.png)\n\nDie App ist kostenlos im Google Play Store verfügbar. Für Ideen und Verbesserungsvorschläge kann gerne ein Pull Request in GitHub gestellt werden.\n\n<br>\n\n## Technologien\n- **Java**\n- **Android** \n \n<br>\n\n## Links\n- [Google Play Store](https://play.google.com/store/apps/details?id=florian.felix.flesch.fpvvideochannelsorter&hl=en)  \n- [GitHub](https://github.com/lexlix/FPV-Video-Channelsorter-5.8GHz)",
  "contentEN": "Der FPV Video Channelsorter 5.8GHz is an open source tool for FPV (First Person View) pilots. The App calculates the optimal distribution of available frequencies to pilots, to reduce interference in the analog video signal.  \nPilots often fly in places where the is bad or no cellular connection, that’s why the app will process all calculations locally on the phone. In the years of development, the app was updated a couple of times with new features, like a frequency overview of all the different FPV equipment vendors and the ability to save and restore groups of pilots.\n\n![App IMG](/assets/img/projects/0001/1.png)\n\nThe App is available for free in the Google Play Store. You can open a pull request on GitHub for new features and ideas.\n\n<br>\n\n## Technologies\n- **Java**\n- **Android** \n \n<br>\n\n## Links\n- [Google Play Store](https://play.google.com/store/apps/details?id=florian.felix.flesch.fpvvideochannelsorter&hl=en)  \n- [GitHub](https://github.com/lexlix/FPV-Video-Channelsorter-5.8GHz)\n",
  "descDE": "Android App - Frequenz Kanal Berechnungstool für FPV Piloten",
  "descEN": "Android App - Frequency channel distribution tool for FPV drone pilots",
  "date": "2017-10-21T00:00:00.700Z",
  "tags": [
    "Android",
    "App",
    "Java",
    "Open Source"
  ],
  "titleDE": "FPV Video Channelsorter 5.8GHz",
  "titleEN": "FPV Video Channelsorter 5.8GHz"
}
