{
  "id": 3,
  "contentDE": "Das Projekt GradeView ist als praktische Gruppenarbeit im Fach Software Engineering im Studiengang [Informatik B.Sc.](https://www.fh-aachen.de/studium/informatik-bsc/) an der FH Aachen entstanden.  \nEs wurde entwickelt, um das unübersichtliche QIS Notensystems der FH Aachen zu erweitern und hilfreicher für Studenten zu gestalten. Da wir als Studenten aber keinen Zugriff auf die API des QIS Notensystems bekommen haben, mussten wir uns einen anderen Weg überlegen, um die Daten des Studenten in unser Tool zu importieren.\\\n<br>\nWir haben uns dazu entschieden, dass man zum \"Login\" die Quelltext HTML der Notenspiegel Seite im QIS Notensystem in unser Tool hochladen muss. Diese enthält alle wichtigen Daten wie Noten und Stammdaten, die wir benötigen. Mittels eines HTML Parsers haben wir alle wichtigen Informationen herausgefiltert und in ein für uns sinnvolles Format umgewandelt. Danach wurde der User von einer Übersicht seiner Daten begrüßt. \n\n![Start IMG](/assets/img/projects/0003/1.png)\n\nZusätzliche Funktionen von GradeView für Studenten sind eine verbesserte Notenübersicht, die klar zeigt, welche Kurse bestanden oder nicht bestanden sind.\n\n![Start IMG](/assets/img/projects/0003/2.png)\n\nSowie eine Modulübersicht über das gesamte Studium, welche genau zeigt welche Prüfungen bis zum Abschluss noch abzulegen sind.\n\n![Start IMG](/assets/img/projects/0003/3.png)\n\nZu guter Letzt ein Wunschnotenrechner, der aus den bereits geschriebenen Noten errechnet, wie gut man die noch abzulegenden Prüfungen schreiben muss, um den gewünschten Notenschnitt zu erreichen, oder ob dieser überhaupt noch erreichbar ist.\n\n![Start IMG](/assets/img/projects/0003/4.png)\n\nDas Tool ist für die kostenlose Verwendung unter dem Link unten auf meinem Server gehostet.\n\n<br>\n\n## Technologien\n- **NodeJS**  \n- **JavaScript** \n\n<br>\n\n## Links\n- [gradeview.felixflesch.de](https://gradeview.felixflesch.de)",
  "contentEN": "The GradeView project was created in a practical group work in the module Software Engineering as part of the degree course [Informatik B.Sc.](https://www.fh-aachen.de/studium/informatik-bsc/) at the FH Aachen.  \nIt was developed to enhance the, confusing and feature lacking, FH Aachen QIS grade system for students. But we, as students, did not get access to the QIS API. That’s why we had to look at other options to get the students data in our new tool.  \n<br>\nWe decided that the student would have to upload the source code HTML file containing their grades from QIS as a \"Login\" process.\nThis page contains all required information like grades, etc.  \nThe first step after uploading the file was running a HTML parser, to extract and format the data to a useful format.  \n<br>\nAfter this step the user was greeted with an overview of the uploaded student’s data. \n\n![Start IMG](/assets/img/projects/0003/1.png)\n\nAdditional functionality is an improved grades overview which shows all passed and failed courses.\n\n![Start IMG](/assets/img/projects/0003/2.png)\n\nAlso, a module overview across the whole degree course with highlighted passed, failed and not yet completed courses. This helps to see what still needs to be accomplished for completion.\n\n![Start IMG](/assets/img/projects/0003/3.png)\n\nAnd finally, the wish grade calculator. You enter the grade you would like to achieve as an average at the end and the calculator tells you, based on your already passed coursed, which grade on average you would need to get in the reminding courses to achieve this. It will also tell you if it's impossible....\n\n![Start IMG](/assets/img/projects/0003/4.png)\n\nThe tool is hosted on my personal server for free use via the link below.\n\n<br>\n\n## Technologies\n- **NodeJS**  \n- **JavaScript** \n\n<br>\n\n## Links\n- [gradeview.felixflesch.de](https://gradeview.felixflesch.de)\n",
  "descDE": "Ein webbasiertes Tool zur Notenanalyse der Studenten der FH Aachen",
  "descEN": "Webbased grade analysis tool for FH Aachen students",
  "date": "2019-01-17T00:00:00.700Z",
  "tags": [
    "NodeJS",
    "HTML Parser"
  ],
  "titleDE": "GradeView",
  "titleEN": "GradeView"
}
