[{"id":6,"contentDE":"[App Store Link](https://apps.apple.com/us/app/bpm-detector/id1586439275)\n\nBPM Detector ist eine iOS App zur Bestimmung der BPM (Beats pro Minute) eines Liedes. Gedacht ist die App unter anderem für Musiker und DJs. Alle funktionellen Funktionen der App sind komplett kostenlos. Zusätzlich ist die App komplett werbefrei. Zur Monetarisierung enthält die App nur einen in App Kauf, mit dem das Design der App angepasst werden kann.  \n\n![App IMG](/assets/img/blog/0008/1.png)\n\nDie Funktionen, die in der App in den jeweiligen Versionen hinzugekommen sind, sind in einem Blogeintrag für jede Version beschreiben.\n\n# Versionen\n\n## [1.1.0](/blog/9)\n30.09.2021\n\n## [1.0.0](/blog/8)\n20.09.2021\n\n## Links\n- [App Store](https://apps.apple.com/us/app/bpm-detector/id1586439275)\n\n<br>\n\n## Technologien:\n- **Swift**  \n- **SwiftUI**","contentEN":"[App Store link](https://apps.apple.com/us/app/bpm-detector/id1586439275)\n\nBPM Detector in an iOS app for determining the BPM (Beats per minute) of a song. The App is meant among others for DJs and musicians. All functional features are free to use. The App also does not show any ads. For monetization, the app includes an in app purchase to customize the app's design.\n\n![App IMG](/assets/img/blog/0008/1.png)\n\nThe functions added to the app in each version are describes in more detail in a blog post for each version.\n\n# Versions\n\n## [1.1.0](/blog/9)\n30.09.2021\n\n## [1.0.0](/blog/8)\n20.09.2021\n\n## Links\n- [App Store](https://apps.apple.com/us/app/bpm-detector/id1586439275)\n\n<br>\n\n## Technologies:\n- **Swift**  \n- **SwiftUI**","descDE":"iOS App zur Geschwindigkeitserkennung eines Liedes","descEN":"iOS app to detect the beats per minute of a song","date":"2021-09-20T14:34:08.700Z","tags":["iOS"," App"," SwiftUI"],"titleDE":"BPM Detector","titleEN":"BPM Detector"},{"id":3,"contentDE":"Das Projekt GradeView ist als praktische Gruppenarbeit im Fach Software Engineering im Studiengang [Informatik B.Sc.](https://www.fh-aachen.de/studium/informatik-bsc/) an der FH Aachen entstanden.  \nEs wurde entwickelt, um das unübersichtliche QIS Notensystems der FH Aachen zu erweitern und hilfreicher für Studenten zu gestalten. Da wir als Studenten aber keinen Zugriff auf die API des QIS Notensystems bekommen haben, mussten wir uns einen anderen Weg überlegen, um die Daten des Studenten in unser Tool zu importieren.\\\n<br>\nWir haben uns dazu entschieden, dass man zum \"Login\" die Quelltext HTML der Notenspiegel Seite im QIS Notensystem in unser Tool hochladen muss. Diese enthält alle wichtigen Daten wie Noten und Stammdaten, die wir benötigen. Mittels eines HTML Parsers haben wir alle wichtigen Informationen herausgefiltert und in ein für uns sinnvolles Format umgewandelt. Danach wurde der User von einer Übersicht seiner Daten begrüßt. \n\n![Start IMG](/assets/img/projects/0003/1.png)\n\nZusätzliche Funktionen von GradeView für Studenten sind eine verbesserte Notenübersicht, die klar zeigt, welche Kurse bestanden oder nicht bestanden sind.\n\n![Start IMG](/assets/img/projects/0003/2.png)\n\nSowie eine Modulübersicht über das gesamte Studium, welche genau zeigt welche Prüfungen bis zum Abschluss noch abzulegen sind.\n\n![Start IMG](/assets/img/projects/0003/3.png)\n\nZu guter Letzt ein Wunschnotenrechner, der aus den bereits geschriebenen Noten errechnet, wie gut man die noch abzulegenden Prüfungen schreiben muss, um den gewünschten Notenschnitt zu erreichen, oder ob dieser überhaupt noch erreichbar ist.\n\n![Start IMG](/assets/img/projects/0003/4.png)\n\nDas Tool ist für die kostenlose Verwendung unter dem Link unten auf meinem Server gehostet.\n\n<br>\n\n## Technologien\n- **NodeJS**  \n- **JavaScript** \n\n<br>\n\n## Links\n- [gradeview.felixflesch.de](https://gradeview.felixflesch.de)","contentEN":"The GradeView project was created in a practical group work in the module Software Engineering as part of the degree course [Informatik B.Sc.](https://www.fh-aachen.de/studium/informatik-bsc/) at the FH Aachen.  \nIt was developed to enhance the, confusing and feature lacking, FH Aachen QIS grade system for students. But we, as students, did not get access to the QIS API. That’s why we had to look at other options to get the students data in our new tool.  \n<br>\nWe decided that the student would have to upload the source code HTML file containing their grades from QIS as a \"Login\" process.\nThis page contains all required information like grades, etc.  \nThe first step after uploading the file was running a HTML parser, to extract and format the data to a useful format.  \n<br>\nAfter this step the user was greeted with an overview of the uploaded student’s data. \n\n![Start IMG](/assets/img/projects/0003/1.png)\n\nAdditional functionality is an improved grades overview which shows all passed and failed courses.\n\n![Start IMG](/assets/img/projects/0003/2.png)\n\nAlso, a module overview across the whole degree course with highlighted passed, failed and not yet completed courses. This helps to see what still needs to be accomplished for completion.\n\n![Start IMG](/assets/img/projects/0003/3.png)\n\nAnd finally, the wish grade calculator. You enter the grade you would like to achieve as an average at the end and the calculator tells you, based on your already passed coursed, which grade on average you would need to get in the reminding courses to achieve this. It will also tell you if it's impossible....\n\n![Start IMG](/assets/img/projects/0003/4.png)\n\nThe tool is hosted on my personal server for free use via the link below.\n\n<br>\n\n## Technologies\n- **NodeJS**  \n- **JavaScript** \n\n<br>\n\n## Links\n- [gradeview.felixflesch.de](https://gradeview.felixflesch.de)\n","descDE":"Ein webbasiertes Tool zur Notenanalyse der Studenten der FH Aachen","descEN":"Webbased grade analysis tool for FH Aachen students","date":"2019-01-17T00:00:00.700Z","tags":["NodeJS","HTML Parser"],"titleDE":"GradeView","titleEN":"GradeView"},{"id":1,"contentDE":"Der FPV Video Channelsorter 5.8GHz ist ein Open Source Hilfstool für FPV (First Person View) Modellflugzeug Piloten. Die App berechnet die optimale Verteilung von verfügbaren Frequenzen auf Piloten, um gegenseitige Störung und Überlagerung von den analogen Videosignalen zu vermindern.  \nDa Piloten oft in Gebieten fliegen wo schlechtes oder kein Mobilfunknetz vorhanden ist, werden alle Berechnungen lokal auf dem Smartphone ausgeführt. In den Jahren der Entwicklung sind immer wieder kleine Features hinzugekommen, wie eine Übersicht aller Frequenzbänder der verschiedenen Hersteller und das Speichern und laden von Piloten presets.\n\n![App IMG](/assets/img/projects/0001/1.png)\n\nDie App ist kostenlos im Google Play Store verfügbar. Für Ideen und Verbesserungsvorschläge kann gerne ein Pull Request in GitHub gestellt werden.\n\n<br>\n\n## Technologien\n- **Java**\n- **Android** \n \n<br>\n\n## Links\n- [Google Play Store](https://play.google.com/store/apps/details?id=florian.felix.flesch.fpvvideochannelsorter&hl=en)  \n- [GitHub](https://github.com/lexlix/FPV-Video-Channelsorter-5.8GHz)","contentEN":"Der FPV Video Channelsorter 5.8GHz is an open source tool for FPV (First Person View) pilots. The App calculates the optimal distribution of available frequencies to pilots, to reduce interference in the analog video signal.  \nPilots often fly in places where the is bad or no cellular connection, that’s why the app will process all calculations locally on the phone. In the years of development, the app was updated a couple of times with new features, like a frequency overview of all the different FPV equipment vendors and the ability to save and restore groups of pilots.\n\n![App IMG](/assets/img/projects/0001/1.png)\n\nThe App is available for free in the Google Play Store. You can open a pull request on GitHub for new features and ideas.\n\n<br>\n\n## Technologies\n- **Java**\n- **Android** \n \n<br>\n\n## Links\n- [Google Play Store](https://play.google.com/store/apps/details?id=florian.felix.flesch.fpvvideochannelsorter&hl=en)  \n- [GitHub](https://github.com/lexlix/FPV-Video-Channelsorter-5.8GHz)\n","descDE":"Android App - Frequenz Kanal Berechnungstool für FPV Piloten","descEN":"Android App - Frequency channel distribution tool for FPV drone pilots","date":"2017-10-21T00:00:00.700Z","tags":["Android","App","Java","Open Source"],"titleDE":"FPV Video Channelsorter 5.8GHz","titleEN":"FPV Video Channelsorter 5.8GHz"}]