{
  "id": 1,
  "titleDE": "iTunes Mediathek zu Apple Music konvertieren",
  "titleEN": "iTunes library to Apple Music conversion",
  "descDE": "Konvertierung der iTunes Mediathek zur neuen Apple Music Mediathek",
  "descEN": "How to convert your old library from iTunes the the new macOS Music app",
  "date": "2020-01-12T00:00:00.700Z",
  "contentDE": "Nach dem Update auf macOS Catalina (macOS 10.15) von einer früheren Version von macOS sollte die Migration der iTunes Mediathek automatisch erfolgreich gewesen sein. Alle Playlisten und Album Cover sind wo sie hingehören.  \n<br>\nEin Problem, auf das ich etwas später nach der macOS Migration gestoßen bin, ist das meine Backups nicht mit der Veränderung der neuen Apple Music Mediathek zusammenarbeiten. Meine Daten sichere ich mit Timemachine. Für meine Musik habe ich nach einer Neuinstallation von macOS, oder dem Wechsel zu einem neuen Mac, einfach den iTunes Ordner kopiert und voila, alle meine Musik war genau wie vorher. (Also **nicht** mein System von Timemachine **automatisch** wiederherstellen lassen) Zu meiner Überraschung klappt das ab Catalina leider nur bedingt gut.\n\n![Music broken covers](/assets/img/blog/0001/1.jpg)\n\nDanach waren nämlich alle cover verschwunden.\nAber warum ist das so?  \n<br>\nBei der Umstellung von iTunes auf Apple Music wurde der Speicherort von der Albumcover Dateien verändert.  \n<br>\nIn meiner Recherche habe ich herausgefunden, dass es 3 Wege gibt seine Musikbibliothek korrekt mit Bildern in die neue Musik App zu importieren:  \n\n<br>  \n\n# 1. Migration durch macOS Upgrade\n\nDies ist der einfachste Weg eine bestehende iTunes Bibliothek zu Apple Music zu konvertieren. Beim Upgrade auf macOS Catalina werden die Bilder automatisch zum neuen Speicherort verschoben.\n\n\n<br>  \n\n# 2. Manuell von einem Backup der alten iTunes Ordnerstruktur\n\n1. Kopiere den backup iTunes Ordner nach `~/Music/iTunes`\n2. Die Taste option/alt gedrückt halten und Apple Musik öffnen\n3. Bei der Abfrage \"_Musikbibliothek auswählen_\" klicken und  `~/Music/iTunes/iTunes Library.itl` auswählen\n4. Fertig\n\n![Music lib selection](/assets/img/blog/0001/3.png)\n\n<br>  \n \n# 3. Migration von bereits migrierten iTunes/Musik Ordner von Catalina zu Catalina\n\nNach der Migration befinden sich unter `~/Music` die beiden Ordner `~/Music/iTunes` & `~/Music/Music`. Beide müssen in einem Backup gesichert werden. Die Bilddateien für die Alben befinden sich aber leider in keinem dieser Ordner. Deshalb muss ein weiterer Ordner gesichert werden:\n<br>  \n`~/Library/Containers/com.apple.AMPArtworkAgent/Data/Documents`\n<br>  \nZum Wiederherstellen sind folgende Schritte notwendig:  \n<br>  \n1. Kopieren des backup iTunes Ordners nach `~/Music/iTunes`\n2. Kopieren des backup Music Ordners nach `~/Music/Music`\n3. Kopieren und überschreiben des _Documents_ Ordners durch das backup `~/Library/Containers/com.apple.AMPArtworkAgent/Data/Documents`\n4. Die Taste option/alt gedrückt halten und Apple Music öffnen\n5. Bei der Abfrage \"Musikbibliothek auswählen\" klicken und `~/Music/Music/Music Library.musiclibrary` auswählen\n6. Fertig\n\n<br>\n<br>\n\n**Alle 3 Methoden sollten zu einer Music App führen die so aussieht:**\n\n![Music working covers](/assets/img/blog/0001/2.jpg)\n",
  "contentEN": "If you just upgraded to Catalina (macOS 10.15) from an older version of macOS the migration of your iTunes library probably went fine, and all playlists songs and albums covers are the way they are supposed to be.  \n<br>\nBut if you are using Timemachine or a different backup method to restore your library to a new computer or after a reinstall of macOS, by copy and pasting the iTunes folder manually (**Not** letting Timemachine restore your Mac **automatically**), Apple music will no longer find images for your album covers.\n\n![Music broken covers](/assets/img/blog/0001/1.jpg)\n\nThat's because during the change from iTunes to Apple Music they changed the location of those images.  \n<br>\nIn my research I found 3 ways to import your Music collection properly with album art to the new Music app:  \n\n<br>\n\n# 1. Migration during macOS Upgrade\n\nThis is the easiest way to convert an iTunes library to Apple Music. Just upgrade your computer with an existing iTunes library to macOS Catalina or higher and you are done. All images will be moved to the new location.\n\n<br>\n\n# 2. Manually from a backup with iTunes folder structure\n\n1. Copy backup iTunes directory to `~/Music/iTunes`\n2. Press and hold option/alt and open Apple Music\n3. Select \"_Choose Library..._\" and select `~/Music/iTunes/iTunes Library.itl`\n4. Done\n\n![Music lib selection](/assets/img/blog/0001/3.png)\n\n<br>  \n\n# 3. Migrate already migrated iTunes/Music directory from Catalina to Catalina\n\nAfter migrating to Apple Music, the directory `~/Music` contains the 2 directories `~/Music/iTunes` & `~/Music/Music`. Both directories need to be included in a backup. But the album art files are in neither of those 2 directories. That's why we also need to back up a third directory:\n<br>  \n`~/Library/Containers/com.apple.AMPArtworkAgent/Data/Documents`\n<br>  \nTo restore the library, we need the following steps:\n<br>  \n1. Copy the backup iTunes directory to `~/Music/iTunes`\n2. Copy the backup Music directory to `~/Music/Music`\n3. Copy and overwrite the _Documents_ directory with the backup`~/Library/Containers/com.apple.AMPArtworkAgent/Data/Documents`\n4. Press and hold option/alt and open Apple Music\n5. Select \"_Choose Library..._\" and select `~/Music/Music/Music Library.musiclibrary`\n6. Done\n\n<br>\n<br>\n\n**All 3 methods should result in an Music app looking like this:**\n\n![Music working covers](/assets/img/blog/0001/2.jpg)",
  "tags": [
    "macOS",
    "iTunes",
    "Music"
  ],
  "projects": []
}
